## Pandas 학습

### 라이브러리 추가

```python
!pip3 install pandas

```
- Successfully installed... >> 최초 설치
- Requirement already stisfied... >> 이미 설치

In [131]:
!pip3 install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
```python
import pandas as pd # as pd로 줄임
```

In [132]:
import pandas as pd

### Pandas 기본 학습
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row)의 각 하나의 유니크 데이터 묶음
- 열(column)의 유니크 데이터의 하나하나 특성

In [133]:
## 2차원 리스트 생성
data = [['messi', 10, 'messi@naver.com', True], ['ronaldo', 7, 'ronaldo@naver.com', True],
        ['roony', 10, 'roony@naver.com', True],['beckem', 7, "beckem@naver.com", True]]

data

[['messi', 10, 'messi@naver.com', True],
 ['ronaldo', 7, 'ronaldo@naver.com', True],
 ['roony', 10, 'roony@naver.com', True],
 ['beckem', 7, 'beckem@naver.com', True]]

In [134]:
## 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름','등번호','이메일','결혼'])
df

        이름  등번호                이메일    결혼
0    messi   10    messi@naver.com  True
1  ronaldo    7  ronaldo@naver.com  True
2    roony   10    roony@naver.com  True
3   beckem    7   beckem@naver.com  True

In [135]:
## 딕셔너리로 DataFrame 객체 생성
data = {'이름' : ['messi', 'ronaldo', 'roony', 'beckem'],'등번호' : [10, 7, 10, 7], 
        '이메일' :['messi@naver.com','ronaldo@nate.com','roony@naver.com',"beckem@naver.com"],
        '결혼': [True, True, True, True]}
df = pd.DataFrame(data=data)
df

        이름  등번호               이메일    결혼
0    messi   10   messi@naver.com  True
1  ronaldo    7  ronaldo@nate.com  True
2    roony   10   roony@naver.com  True
3   beckem    7  beckem@naver.com  True

In [136]:
## DataFrame에서 데이터 조회(열) >> 리스트는 for문을 써야 출력가능
df['이름']

0      messi
1    ronaldo
2      roony
3     beckem
Name: 이름, dtype: object

In [137]:
## DataFrame 조회
df[['이름', '등번호']]

        이름  등번호
0    messi   10
1  ronaldo    7
2    roony   10
3   beckem    7

In [138]:
## DataFrame 행으로 조회
df.loc[0]

이름               messi
등번호                 10
이메일    messi@naver.com
결혼                True
Name: 0, dtype: object

In [139]:
## DataFrame 조회 (행)
df.loc[[0, 1, 3]]

        이름  등번호               이메일    결혼
0    messi   10   messi@naver.com  True
1  ronaldo    7  ronaldo@nate.com  True
3   beckem    7  beckem@naver.com  True

In [140]:
# 현재 DataFrame 확인
df

        이름  등번호               이메일    결혼
0    messi   10   messi@naver.com  True
1  ronaldo    7  ronaldo@nate.com  True
2    roony   10   roony@naver.com  True
3   beckem    7  beckem@naver.com  True

In [141]:
## 새 컬럼 추가
df['전번'] = ['010', '011', '017', '019']

In [142]:
# 추가된 DataFrame 확인
df

        이름  등번호               이메일    결혼   전번
0    messi   10   messi@naver.com  True  010
1  ronaldo    7  ronaldo@nate.com  True  011
2    roony   10   roony@naver.com  True  017
3   beckem    7  beckem@naver.com  True  019

In [143]:
## 열 삭제
df.drop('결혼', axis = 1) ## axis = 0 >> 행, axis = 1 >> 열

        이름  등번호               이메일   전번
0    messi   10   messi@naver.com  010
1  ronaldo    7  ronaldo@nate.com  011
2    roony   10   roony@naver.com  017
3   beckem    7  beckem@naver.com  019

In [144]:
## drop()은 열or행을 삭제하고 출력만 함 >> 완전 삭제는 inplace 옵션 사용
# inplace >> 화면 출력 안됨 (따로 출력) 
df.drop('결혼', axis = 1, inplace = True)

In [145]:
## 삭제 확인
df

        이름  등번호               이메일   전번
0    messi   10   messi@naver.com  010
1  ronaldo    7  ronaldo@nate.com  011
2    roony   10   roony@naver.com  017
3   beckem    7  beckem@naver.com  019

In [146]:
## 행 추가
df.loc[4] = ['son', 32, 'son@naver.com', '020']

In [147]:
## 추가 확인
df

        이름  등번호               이메일   전번
0    messi   10   messi@naver.com  010
1  ronaldo    7  ronaldo@nate.com  011
2    roony   10   roony@naver.com  017
3   beckem    7  beckem@naver.com  019
4      son   32     son@naver.com  020

In [148]:
## 행 삭제, 완전 삭제는 inplace 사용 아니면 변수에 재할당
df2 = df.drop(3)

In [149]:
## 삭제 확인
df2

        이름  등번호               이메일   전번
0    messi   10   messi@naver.com  010
1  ronaldo    7  ronaldo@nate.com  011
2    roony   10   roony@naver.com  017
4      son   32     son@naver.com  020

In [150]:
## 행삭제 inplace, 행삭제시는 axic = 0 만 사용 또는 생략
df.drop(2, axis = 0, inplace = True)

In [151]:
## 삭제 확인
df

        이름  등번호               이메일   전번
0    messi   10   messi@naver.com  010
1  ronaldo    7  ronaldo@nate.com  011
3   beckem    7  beckem@naver.com  019
4      son   32     son@naver.com  020

In [152]:
## 열 이름을 변경
df.rename(columns={'전번' : '휴대폰'}, inplace=True)

- dataFrame은 파이썬의 2차원 리스트와 동일하지만, 좀 더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈들 그루핑한게 dataFrame
- 가장 최소 단위

In [153]:
data = [10, 7, 10, 7, 7]
series = pd.Series(data = data)
series

0    10
1     7
2    10
3     7
4     7
dtype: int64

In [154]:
## dataFrame의 한 열을 가지고 온 자료구조와 시리즈는 동일
type(df['등번호'])

pandas.core.series.Series

In [155]:
type(series)

pandas.core.series.Series

In [156]:
series = pd.Series(data=data, index=['messi', 'ronaldo', 'roony', 'beckem', 'son'])
series

messi      10
ronaldo     7
roony      10
beckem      7
son         7
dtype: int64

In [157]:
## 조회
series['messi']

10

In [158]:
# dataFrame에서 한 행을 가져와도 시리즈
df.loc[1]

이름              ronaldo
등번호                   7
이메일    ronaldo@nate.com
휴대폰                 011
Name: 1, dtype: object

#### dataFrame 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인, GrapeCity의 Excel Viewer 설치
- 엑셀파일을 로드 할 때는 openpyxl 라이브러리 추가
```python
> !pip3 install openpyxl
```

In [199]:
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8', header=1, skipfooter=2)
df_csv
# header=1 >> 헤더로 사용할 열 지정
# skipfooter=2 >> 뒤에서 n개 행 생략


# 'utf-8' codec can't decode byte 0xb3 in position 0: invalid start byte
# >> 파이선이 한글을 인식하지 못해서 생기는 오류 >> encoding='cp949' 로 대체

/var/folders/44/0l87xs4136n5n95018b2kvrc0000gn/T/ipykernel_5626/2136385554.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8', header=1, skipfooter=2)

  국적코드  성별    입국객수    전년동기
0  A01  남성  106320   85815
1  A01  여성  191436  125241
2  A31  남성     319     299
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466

In [160]:
# openpyxl 설치
!pip3 install openpyxl

Requirement already satisfied: openpyxl in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from openpyxl) (1.1.0)

In [161]:
## 엑셀 로드
df_xls = pd.read_excel('./data/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C', sheet_name='Sheet1')
df_xls

# usecols='A:C' >> A ~ C 열만 가져옴
# sheet_name='Sheet1' >> 시트 이름 지정

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [162]:
## dataFrame 정보 확인
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
 3   전년동기    6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [201]:
## 데이터 일부 보기(위에서 부터 >> n = 5 기본)
df_csv.head(10)

  국적코드  성별    입국객수    전년동기
0  A01  남성  106320   85815
1  A01  여성  191436  125241
2  A31  남성     319     299
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466

In [164]:
## 데이터 일부 보기(아래에서 부터 >> n = 5)
df_csv.tail(n=3)

  국적코드  성별    입국객수    전년동기
3  A31  여성      42      54
4  A18  남성  158912  124486
5  A18  여성  232943  163466

In [165]:
## 통계량 요약보기
df_csv.describe()

                입국객수           전년동기
count       6.000000       6.000000
mean   114995.333333   83226.833333
std     98105.752006   68858.227184
min        42.000000      54.000000
25%     26819.250000   21678.000000
50%    132616.000000  105150.500000
75%    183305.000000  125052.250000
max    232943.000000  163466.000000

In [166]:
# df_csv[['국적코드', '입국객수']]

# 모두 다른 데이터를 할당 가능
df_csv['기준년월'] = ['2023-10', '2023-11', '20203-12', '2024-01', '2024-02', '2024-03']
df_csv

  국적코드  성별    입국객수    전년동기      기준년월
0  A01  남성  106320   85815   2023-10
1  A01  여성  191436  125241   2023-11
2  A31  남성     319     299  20203-12
3  A31  여성      42      54   2024-01
4  A18  남성  158912  124486   2024-02
5  A18  여성  232943  163466   2024-03

In [167]:
## 하나의 데이터로
df_csv['기준년월'] = '2023-12'
df_csv

  국적코드  성별    입국객수    전년동기     기준년월
0  A01  남성  106320   85815  2023-12
1  A01  여성  191436  125241  2023-12
2  A31  남성     319     299  2023-12
3  A31  여성      42      54  2023-12
4  A18  남성  158912  124486  2023-12
5  A18  여성  232943  163466  2023-12

In [168]:
df_csv.loc[[0,1,2]] # dataFrame

  국적코드  성별    입국객수    전년동기     기준년월
0  A01  남성  106320   85815  2023-12
1  A01  여성  191436  125241  2023-12
2  A31  남성     319     299  2023-12

In [169]:
df_csv.loc[0:4]

  국적코드  성별    입국객수    전년동기     기준년월
0  A01  남성  106320   85815  2023-12
1  A01  여성  191436  125241  2023-12
2  A31  남성     319     299  2023-12
3  A31  여성      42      54  2023-12
4  A18  남성  158912  124486  2023-12

In [170]:
## 필터링 
condition = (df_csv['국적코드'] == 'A31')
condition

0    False
1    False
2     True
3     True
4    False
5    False
Name: 국적코드, dtype: bool

In [171]:
## 필터링 >> 국적코드가 A31인 행
df_csv[condition]

  국적코드  성별  입국객수  전년동기     기준년월
2  A31  남성   319   299  2023-12
3  A31  여성    42    54  2023-12

In [172]:
## 상단의 condition 변수 만드는 부분과 사용하는 부분을 합칠수 있음
df_csv[df_csv['성별'] == '여성']

  국적코드  성별    입국객수    전년동기     기준년월
1  A01  여성  191436  125241  2023-12
3  A31  여성      42      54  2023-12
5  A18  여성  232943  163466  2023-12

In [173]:
## 입국객수가 20만 이상
df_csv[df_csv['입국객수'] >= 200_000]

  국적코드  성별    입국객수    전년동기     기준년월
5  A18  여성  232943  163466  2023-12

In [174]:
## 여러조건 필터링
df_csv[(df_csv['성별'] == '남성') & (df_csv['입국객수'] >= 150_000)]

  국적코드  성별    입국객수    전년동기     기준년월
4  A18  남성  158912  124486  2023-12

In [175]:
## 한 열에 여러값으로 필터링
df_csv[df_csv['국적코드'].isin(['A01', 'A31']) == False]

  국적코드  성별    입국객수    전년동기     기준년월
4  A18  남성  158912  124486  2023-12
5  A18  여성  232943  163466  2023-12

In [176]:
# dataFrame에 새 컬럼 생성
df_csv['국적명'] = ['일본', '일본', '괌', '괌', '중국', '중국']
df_csv

  국적코드  성별    입국객수    전년동기     기준년월 국적명
0  A01  남성  106320   85815  2023-12  일본
1  A01  여성  191436  125241  2023-12  일본
2  A31  남성     319     299  2023-12   괌
3  A31  여성      42      54  2023-12   괌
4  A18  남성  158912  124486  2023-12  중국
5  A18  여성  232943  163466  2023-12  중국

In [177]:
## dataFrame에 인덱스 변경
df_csv.set_index(keys='국적명')

    국적코드  성별    입국객수    전년동기     기준년월
국적명
일본   A01  남성  106320   85815  2023-12
일본   A01  여성  191436  125241  2023-12
괌    A31  남성     319     299  2023-12
괌    A31  여성      42      54  2023-12
중국   A18  남성  158912  124486  2023-12
중국   A18  여성  232943  163466  2023-12

In [178]:
# 인덱스 리셋
df_csv = df_csv.reset_index()
df_csv

   index 국적코드  성별    입국객수    전년동기     기준년월 국적명
0      0  A01  남성  106320   85815  2023-12  일본
1      1  A01  여성  191436  125241  2023-12  일본
2      2  A31  남성     319     299  2023-12   괌
3      3  A31  여성      42      54  2023-12   괌
4      4  A18  남성  158912  124486  2023-12  중국
5      5  A18  여성  232943  163466  2023-12  중국

In [188]:
## 그룹화 groupby() 함수만으로 사용X 
## 여러 함수를 같이 사용해야 dataFrame으로 출력
df_csv.groupby('국적명').count()

     국적코드  성별  입국객수  전년동기  기준년월
국적명
괌       2   2     2     2     2
일본      2   2     2     2     2
중국      2   2     2     2     2

In [194]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
 3   전년동기    6 non-null      int64
 4   기준년월    6 non-null      object
 5   국적명     6 non-null      object
dtypes: int64(2), object(4)
memory usage: 420.0+ bytes

In [191]:
df_csv.describe()

                입국객수           전년동기
count       6.000000       6.000000
mean   114995.333333   83226.833333
std     98105.752006   68858.227184
min        42.000000      54.000000
25%     26819.250000   21678.000000
50%    132616.000000  105150.500000
75%    183305.000000  125052.250000
max    232943.000000  163466.000000

In [193]:
## info()함수로 리스트를 보았을때 dataType이 int, float이 아닌것은 sum() 합산 의미X
df_csv.groupby('국적명').sum('입국객수')

       입국객수    전년동기
국적명
괌       361     353
일본   297756  211056
중국   391855  287952

In [195]:
## 그룹화 후 통계함수 사용시 동일하게 적용
## median(중앙값), min(최소), max(최대), std(표즌편차), var(분산)
df_csv.groupby('국적명').mean('입국객수')

         입국객수      전년동기
국적명
괌       180.5     176.5
일본   148878.0  105528.0
중국   195927.5  143976.0

In [196]:
## 오름차순 정렬
df_csv.sort_values('입국객수')

  국적코드  성별    입국객수    전년동기     기준년월 국적명
3  A31  여성      42      54  2023-12   괌
2  A31  남성     319     299  2023-12   괌
0  A01  남성  106320   85815  2023-12  일본
4  A18  남성  158912  124486  2023-12  중국
1  A01  여성  191436  125241  2023-12  일본
5  A18  여성  232943  163466  2023-12  중국

In [198]:
## 내림차순 정렬
df_csv.sort_values('입국객수', ascending=False)

  국적코드  성별    입국객수    전년동기     기준년월 국적명
5  A18  여성  232943  163466  2023-12  중국
1  A01  여성  191436  125241  2023-12  일본
4  A18  남성  158912  124486  2023-12  중국
0  A01  남성  106320   85815  2023-12  일본
2  A31  남성     319     299  2023-12   괌
3  A31  여성      42      54  2023-12   괌